{
   "page":1,
   "page_count":18180,
   "items_per_page":20,
   "took":26,
   "timed_out":false,
   "total":363583,
   "results":[
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>What You’ll Do</strong></p>\n\n<ul>\n<li>You will be identifying, negotiating and closing big deals in a defined territory.  You will be working with CMOs and CTOs of some of the biggest brands in the world. You will be working with them to build solutions that allow them to win. <strong>We are customer obsessed.</strong></li>\n<li>You will be called upon to utilize superior salesmanship to develop sales opportunities and identify the necessary decision makers and influencers of the prospective deal.  <strong>We believe it is OK, be fearless.</strong></li>\n<li>You will listen, identify and understand clients/prospective clients needs and deliver to their expectations. You will be able to build relationships with multiple stakeholders and influence them in a positive way.  <strong>Helping others succeed makes us happy.</strong></li>\n<li>You will actively seek out new sales leads and business opportunities through active networking and utilizing business referrals. <strong>We passionately, genuinely care.  </strong></li>\n<li>You are hugely curious will constantly look for ways to enhance your knowledge of our industry, market, and competitors to provide that sales edge needed to close business and generate revenue.  <strong>We believe that every human has the potential to be amazing.  Keep learning. AND be curious: we are constantly looking for ways to enhance knowledge of our industry, market and competitors to provide the sales edge to close business and generate revenue.  </strong></li>\n<li>You will seek feedback at every opportunity so you can be the best you can be.  You will seek this from leaders, peers and clients. <strong>We do the right thing always and take extreme pride in who we are, what we build and what we do.  AND, we are led by character.</strong></li>\n</ul>\n\n<p><strong>Who You Are &amp; What Makes You Qualified </strong></p>\n\n<ul>\n<li>You are one to the top 10% of the sales people in your current company/division.  You have a track record of being one of the best. You are someone who pursues your passions with energy and commitment. <strong> We never, ever give up.</strong></li>\n<li>You are incredibly smart (we are in a very fast moving industry and you have to be nimble of mind to keep up) and have a work ethic second to none.  <strong>Every human has the potential to be amazing.  Keep learning. AND we are coachable.  </strong></li>\n<li>You’ve got 4-8 years of enterprise software sales experience, meaning you’ve experienced the full range of obstacles when behind the wheel of creating a complex &amp; enterprise wide SaaS deals.  <strong>We are customer obsessed.</strong></li>\n<li>You’ve been successful in building relationships – Sprinklr is a best in class solution.. But we’ve succeeded because we genuinely care about how we make people feel. You share the same values, know that relationships are everything and have the ability to use these to identify and develop new business opportunities. <strong>We passionately, genuinely care.</strong></li>\n<li>You love the Customer Experience revolution! It’s not just social, it’s the entire relationship between global brands and consumers that’s changing, and as social interactions evolve in importance, Sprinklr is right in the middle of it. Your desire and ability to embrace this change and understand how social media platforms can impact the various functions of a large organization is critical.  <strong>We do the right thing always, and take extreme pride in who we are, what we build and what we do. </strong></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Global Strategic Account Executive - PNW ",
         "type":"external",
         "publication_date":"2021-04-20T23:15:17Z",
         "short_name":"global-strategic-account-executive-pnw-a79f6d",
         "model_type":"jobs",
         "id":5636822,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            {
               "name":"Sales"
            }
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/global-strategic-account-executive-pnw-a79f6d"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span>What You’ll Do</span></p>\n\n<p><span>The Success Manager owns delivery and program management to ensure customers are realising value and are renewable.</span><span><br><br></span></p>\n\n<ul>\n<li><span>Program manage to deliver what the customer is paying for. Complete oversight and seamless management of the post-sales customer journey (services, support, product management, executive alignment) across the global footprint of the account.</span><span><br><br></span></li>\n<li><span>Be an expert on the Sprinklr Platform to drive adoption and consumption. You know how all our products can be used to create value for customers and their business goals, and become a trusted advisor driving digital transformation.</span><span><br><br></span></li>\n<li><span>Make sure the customer sees business value. Continually align to the positive business outcomes and customer use cases and ensure delivery, including: </span><span><br><br></span></li>\n<ul>\n<li><span>Identifying and mitigating risks</span></li>\n<li><span>Assessing, quantifying and aligning with customers on value delivered</span></li>\n<li><span>Owning renewal on current terms</span></li>\n<li>Identifying upsell opportunities   </li>\n</ul>\n</ul>\n\n<p><span>Who You Are &amp; What Makes You Qualified? </span><span><br></span><span> </span></p>\n\n<p><span>To program manage to deliver what the customer is paying for, you are:</span></p>\n\n<ul>\n<li><span>Experienced in program and project management for global customers</span></li>\n<li><span>Efficient management of a customer renewal cycle and driving 90%+ retention across a BoB</span></li>\n<li><span>Highly organized and detail-oriented</span></li>\n<li><span>Likeable with strong communication, and motivational skills</span></li>\n<li><span>Skilled in building relationships and flawlessly navigating company ecosystems to solve customer challenges</span></li>\n<li><span><span>Experienced driving the social and marketing strategies across enterprise customers, up through C-suites (IE CMO)</span></span>\n<p><span>To be an expert on the Sprinklr Platform to drive adoption and consumption, you are:</span></p>\n<span><span><br></span></span>\n<ul>\n<li><span>Able to master all 5 Sprinklr products, with experience maximizing platform features to exceed client expectations</span></li>\n<li><span>Continuously solving customer challenges, while providing thought leadership to align to best practices</span><span><br><br></span></li>\n</ul>\n<p><span>To make sure the customer sees business value, you are: </span></p>\n<span><span><br></span></span>\n<ul>\n<li><span>Experienced working with multinational, Fortune 100 enterprise brands</span></li>\n<li><span>Knowledge working alongside customers, at all levels, to understand their business and map platform value back to challenges</span></li>\n<li><span>Quick to understand problems and passionate about solving them</span></li>\n<li><span>Understand the importance in offering smart, thought-leadership to drive your customers forward</span></li>\n</ul>\n<span><span><br></span></span>\n<p><span>Additional Qualifications</span></p>\n<ul>\n<li><span>5+ years of experience in B2B SaaS customer success, account management, product management or a strategic consulting organization</span></li>\n<li><span>Demonstrated experience and a passion for the social technology universe (i.e., Facebook, Twitter, YouTube, Instagram, Flickr, blogs, G+, LinkedIn, wikis, RSS, social bookmarking, discussion forums and community software)</span></li>\n<li><span>Experience using customer success software, CRM software (ideally Salesforce), and Google Applications (Docs, Sheets, Slides)</span></li>\n<li><span>Fluent in English, and ideally one other major European language </span></li>\n<li><span>Bachelor’s and/ or Master’s degree from a top college or university</span></li>\n<li><span>Expected to travel up to 25-30% of the time on average</span></li>\n</ul>\n</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Senior Success Manager (Global Strategic Accounts)",
         "type":"external",
         "publication_date":"2021-05-12T11:13:18Z",
         "short_name":"senior-success-manager-global-strategic-accounts-3953e6",
         "model_type":"jobs",
         "id":5810600,
         "locations":[
            {
               "name":"London, United Kingdom"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/senior-success-manager-global-strategic-accounts-3953e6"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Sr Revenue Analyst </strong></p>\n\n<p>Sprinklr, the world’s leading modern front office platform for the enterprise is looking for an experienced senior accountant in the revenue team of this pre‐ipo global enterprise software company. The position is based at its global headquarters in Midtown Manhattan, NYC and will report to the Global Revenue Manager. This is an exciting opportunity for a talented individual to join a dynamic global finance team, work on all manner of revenue related accounting matters and be able to influence the evolution and development of the function.</p>\n\n<p><br><strong>Main Responsibilities:</strong> </p>\n\n<ul>\n<li>Review customer contracts to determine appropriate revenue recognition treatment in <br>accordance with ASC 606</li>\n<li>Support global revenue manager with analysis and intelligence on our customer contracts and <br>the associated revenue recognition Analyze and report key revenue metrics and results.</li>\n<li>Provide guidance to the order entry team to ensure customer contracts are recorded accurately</li>\n<li>Work closely with Sales Operations and Accounts Receivable teams on all customer contract <br>matters.</li>\n<li>Perform the monthly close tasks associated with revenue including the preparation of various <br>reconciliations, revenue journal entries and revenue related analysis.</li>\n<li>Work closely with external audit team regarding all quarterly review and annual audit <br>requirements.</li>\n<li>Assist in the design, development and implementation of global revenue process controls</li>\n<li>Support the completion of all revenue related disclosures in the financial statements.</li>\n<li>Participate in ad‐hoc projects as required</li>\n</ul>\n\n<p><strong>Desired Skills and Experience:</strong></p>\n\n<ul>\n<li>Minimum 6 years of public or private accounting experience including 3‐5 years of experience in <br>a general ledger accounting or revenue accounting role</li>\n<li>Must have a CPA and a bachelor’s degree in accounting, finance or a related field</li>\n<li>Proven ability to work under pressure in a high growth environment.</li>\n<li>Familiarity with NetSuite accounting system and Salesforce CRM a plus</li>\n<li>Must be able to multi‐task, prioritize, and be detail oriented</li>\n<li>Ability to work as part of a team or independently as needed</li>\n<li>Familiarity with Microsoft Office, including advanced Excel skills</li>\n<li>Proven ability to take initiative and be proactive</li>\n<li>Must have the desire to learn and to grow</li>\n</ul>\n\n<p><br><strong>About Sprinklr</strong><br>Sprinklr makes enterprise software to help brands reach, engage and listen to their customers across modern channels (social, messaging, forums and voice). Every customer‐facing department – including marketing, care and sales – relies on Sprinklr’s unified platform of Social + Messaging, Digital and CXM capabilities to help them make customers happier. This unified approach to customers drives compliance, security, and privacy – critical in today’s challenging regulatory environment. </p>\n\n<p>Headquartered in New York City, Sprinklr works with more than 1,200 of the world’s most valuable brands, including: Allstate, McDonald’s, Microsoft, Nike, NASA, Signify, Procter &amp; Gamble, Samsung, Santander, Shell and Verizon. Sprinklr’s partners include Accenture, Deloitte, IBM, Microsoft, and SAP. <br> </p>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Senior Revenue Accountant",
         "type":"external",
         "publication_date":"2021-05-17T23:10:26Z",
         "short_name":"senior-revenue-accountant-cdd7c5",
         "model_type":"jobs",
         "id":5840781,
         "locations":[
            {
               "name":"New York, NY"
            }
         ],
         "categories":[
            {
               "name":"Accounting"
            }
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/senior-revenue-accountant-cdd7c5"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p>Sprinklr is looking for a Senior Manager, Solutions Consulting to lead presales for ANZ and Korea. You will be responsible for leading a team of Solutions Consultants (SCs) in their designated region, coaching on opportunities, serving as solutions sponsor within key accounts as well as recruiting and developing team members.</p>\n\n<p><strong>Overall Description</strong></p>\n\n<p>As Senior Manager, Solutions Consulting you will be the primary contact for the Solutions Consultants on your team, managing their training, development and growth. You regularly observe your team in the field and provide routine feedback. You will guide your team in monthly, quarterly and yearly goal setting exercises, helping them to develop in their current role and gain skills and experience for their long-term career goals. Additionally, you will be responsible for ensuring your team is trained on product enhancements, new modules, and various use cases as the platform continually evolves.</p>\n\n<p>You will assume responsibility for resource allocation in your region as well, working alongside the Director(s) of Sales in your region to manage SC resources, align the appropriate SC for the deal based on experience, and help prioritize sales activity.</p>\n\n<p>Additionally, you will continue to engage in sales opportunities as a Solutions Consultant in a player-coach role. Solutions Consultants at Sprinklr are social media and product experts who serve as the key point of contact for our sales team and customers throughout the sales process. You will perform software demonstrations online via web conference or in-person while accompanying a sales executive on-site with our potential clients. You will be instrumental to the success of the sales team tasked with growing opportunities with Sprinklr’s high profile accounts while acting as leaders on the solutions consulting team.</p>\n\n<p><strong>Main Responsibilities:</strong></p>\n\n<ul>\n<li>Lead a team of Solutions Consultants, potentially recruiting new team members to account for growth or attrition.</li>\n<li>Function as primary contact for the Director(s) of Sales that work within the designated region.</li>\n<li>Facilitate SC resource allocation across the region and assist in providing SC resource support for other regions as well.</li>\n<li>Train and support the SC team in delivering our value propositions, product demonstrations and RFPs.</li>\n<li>Proactively engage in strategic development of the SC organization by initiating and leading projects to further team development, organizational structure, product offering, technical training, etc.</li>\n<li>Engage in the duties of a Solutions Consultant below, as a player-coach:</li>\n<ul>\n<li>Act as key contact in creation, presentation, demonstration and maintenance of content specific to sales efforts</li>\n<li>Work directly with customers to educate them on the full functionality of the Sprinklr platform through:</li>\n<ul>\n<li>Participating in meetings with the sales team to understand prospects current and future social states, identify a fit for Sprinklr in their business and answer questions about our products and services.</li>\n<li>Performing live demonstrations.</li>\n<li>Conducting hands-on workshops.</li>\n</ul>\n<li>Coordinate and manage customer communication of detailed implementation, performance, analytics and other features of our software.</li>\n<li>Assist sales team in creating responses to RFI’s and RFP’s from major clients.</li>\n<li>Frequent travel and participation in industry events and customer-facing meetings.</li>\n<li>Acting as the SC lead on strategic deals across focus accounts.</li>\n<li>Assisting in the development of regional team members across their technological and strategic practices.</li>\n</ul>\n</ul>\n\n<p><strong>Desired Skills and Experience:</strong></p>\n\n<ul>\n<li>3+ years of presales management experience.</li>\n<li>5+ years experience in customer facing role in enterprise software company.</li>\n<li>3+ years experience in customer experience, adtech, martech, etc. technologies.</li>\n<li>Proven track record of leadership capabilities across teams and projects.</li>\n<li>Ability to present and effectively communicate to customers and team members.</li>\n<li>Excellent written, communication and presentation skills.</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":" Senior Manager, Solutions Consulting (presales) - ANZ/Korea",
         "type":"external",
         "publication_date":"2021-04-20T23:15:18Z",
         "short_name":"senior-manager-solutions-consulting-presales-anzkorea",
         "model_type":"jobs",
         "id":5551972,
         "locations":[
            {
               "name":"Sydney, Australia"
            }
         ],
         "categories":[
            {
               "name":"Sales"
            }
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/senior-manager-solutions-consulting-presales-anzkorea"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><a href=\"https://www.sprinklr.com/\"><span>Sprinklr</span></a><span> is the world’s leading Customer Experience Management (CXM) platform. We help organizations listen to customers, learn from them, and show them love across digital channels. We’re one of the fastest-growing software companies and we work in a fast-paced, high energy and fun environment. </span></p>\n\n<p><span>We’re on an exciting journey to tell the world who we are, what we do, and what makes us special. We’re looking for a Global Public Relations Leader who is a culture fit for our </span><em><span>Sprinklr Way</span></em> <strong>and</strong> <span>a deep subject matter expert in Public Relations strategy- a storyteller and relationship extraordinaire.</span></p>\n\n<p><span>From building and strengthening relationships with top-tier press and key influencers to extending the visibility of Sprinklr’s executives in the market, you’ll have primary responsibility for bringing Sprinklr’s story and point-of-view to the world.</span></p>\n\n<p><span>These are the three key things you’ll help us do. 1. Craft and tell compelling Sprinklr stories 2. Activate</span><span> PR campaigns that advance our mission and strategy while positioning our leadership in the customer experience category and 3. Build and scale a global PR function that supports an exciting and growing business around the world. </span></p>\n\n<p><span>This role reports to the Head of Corporate Communications in Sprinklr’s Marketing team. </span></p>\n\n<p><strong>Here are some of the things you’ll do: </strong></p>\n\n<ul>\n<li><span>Build and oversee global PR efforts, coordinating global teams and agencies</span></li>\n<li><span>Establish and strengthen Sprinklr’s relationship with press- print and broadcast and key influencers</span></li>\n<li><span>Help shape the future of enterprise software and stories in social media</span></li>\n<li><span>Identify, package, and proactively promote customer, partner, product and corporate news and other stories that advance Sprinklr’s business objectives and brand</span></li>\n<li><span>Partner to develop and drive an executive visibility strategy and thought leadership program supported by creating the right content and speaking opportunities</span></li>\n<li><span>Leverage data from Sprinklr’s platform to surface newsworthy insights and trends </span></li>\n</ul>\n\n<p><strong>Who You Are And What Makes You Qualified:</strong></p>\n\n<ul>\n<li><span>10+ years experience in corporate communications and public relations, preferably with expertise in enterprise software, B2B / marketing technology, and/or social</span></li>\n<li><span>An effective communicator and storyteller who can work with cross-functional teams, manage multiple complex projects simultaneously, and produce under tight deadlines</span></li>\n<li><span>A strategic, objective-oriented, dot-connecting and decisive thinker capable of marrying past experiences with fresh thinking to deliver results</span></li>\n<li><span>A strong writer who can turn technical capabilities into clear, concise, and compelling benefits for the right audience</span></li>\n<li><span>A proactive, organized, self-directed, results oriented driver</span></li>\n<li><span>You possess a high work ethic, positive attitude, and almost-obsessive attention to detail</span></li>\n<li><span>You have a proven ability to build trusted relationships with key media and influencers in the enterprise software, marketing technology, and social spaces</span></li>\n<li><span>You work at a fast pace, you thrive in high pressure environments, and you still know how to laugh and have fun!</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Director, Public Relations",
         "type":"external",
         "publication_date":"2021-04-20T23:15:17Z",
         "short_name":"director-public-relations-6bcaaf",
         "model_type":"jobs",
         "id":5272962,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/director-public-relations-6bcaaf"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Meet Our Team: </strong><span>Our Inside Sales Team resides under the Marketing umbrella and you will be able to see how this structure supports the everyday functions of the organization and is critical to its overall success. Our Inside Sales team is both motivated and creative, and made up of two different groups: Sales Development Representatives (SDRs) who actively seek out new sales leads and business opportunities and Experience Development Representatives (XDRs) who support SDRs in their outreach.</span></p>\n\n<p><strong>What We Need</strong></p>\n\n<p><span>We are seeking highly motivated and sales/marketing savvy interns to help us accomplish our objectives, create a Sprinklr presence, and assist with our rapid expansion. </span></p>\n\n<p><strong>Who You Are</strong></p>\n\n<p><span>You love a good challenge and have a grit that keeps you moving toward your objectives no matter what stands in your way. You are social media savvy and consider yourself pretty good at understanding its value to transform the modern enterprise. You are tech-savvy, an excellent communicator, and a great self-starter. </span></p>\n\n<p><strong>What You’ll Do</strong><span> </span></p>\n\n<p><span>This isn’t a “ grab us a latte” internship -- you’ll have the opportunity to partner with, shadow, and gain exposure to Inside Sales and the broader sales cycle. You will:</span></p>\n\n<ul>\n<li><span>Develop an understanding of Sprinklr’s products, services, partners, and value proposition and the key attributes of our “buyer personas” </span></li>\n<li><span>Develop a knowledge base relevant to role-, solution-, or vertical-based components of strategy to drive B2B sales pipeline</span></li>\n<li><span>Research prospect’s key business initiatives and strategies using sources such as industry articles and analysts reports, blog posts, public filings, and press releases</span></li>\n<li><span>Use the Sprinklr platform for building brand-specific listening and benchmarking dashboards</span></li>\n<li><span>Aid in the development and coordination of internal team trainings and make updates to our playbook</span></li>\n<li><span>Leverage core Sales technologies such as: Sprinklr, LinkedIn Sales Navigator, Salesloft, ZoomInfo, Salesforce CRM, etc.</span></li>\n</ul>\n\n<p><strong>What’s In It For You</strong></p>\n\n<p><span>The chance to be part of a company's growth story, the likes of which you may never encounter again for the rest of your life, and the opportunity to sit at the epicenter of the greatest transformation in the world of business in the last 100 years.</span></p>\n\n<p><strong>What Makes You Qualified</strong><span> </span></p>\n\n<ul>\n<li><span>Pursuing a Four-year college degree (preferably in Marketing, Humanities, Communications, or Business)</span></li>\n<li><span>Have a passion for technology and disruptive technology</span></li>\n<li><span>Excellent written and verbal communication skills</span></li>\n<li><span>Strong work ethic, including the ability to work both independently and with a team</span></li>\n<li><span>Ability to work between 20-30 hours per week from February 1, 2021 - April 9, 2021 (10 weeks)</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Inside Sales Intern Summer 2021",
         "type":"external",
         "publication_date":"2021-04-20T23:15:18Z",
         "short_name":"inside-sales-intern-summer-2021",
         "model_type":"jobs",
         "id":5598961,
         "locations":[
            {
               "name":"Austin, TX"
            }
         ],
         "categories":[
            {
               "name":"Sales"
            }
         ],
         "levels":[
            {
               "name":"Internship",
               "short_name":"internship"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/inside-sales-intern-summer-2021"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Partner Development Manager - Southwest</strong><br/>\n<p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier.</strong></p><br/>\n<p><strong>Partner Development Manager/Business Development Manager</strong></p><br/>\n<p><span>Partner Development Manager will lead our sales teams’ engagement with our partner accounts. Ideal candidate will have a mix of business development, relationship management, strategic planning, and account management. Experience in direct sales, traditional consulting or at a SaaS player is a plus. Must be able to communicate thoughts and ideas exceptionally well, self-sufficient and able to manage multiple projects with little supervision. The Alliances business development manager is primarily responsible for working with the direct sales team to engage Alliance partners in sales opportunities in a co-sell environment. This is a quota carrying position. Must be committed to working in a fast-paced environment.</span></p><br/>\n<p><strong>Summary:</strong></p><br/>\n<ul><br/>\n<li><span>A leader in the following areas:</span></li><br/>\n<ul><br/>\n<li><span>Relationship management, building relationships with both direct sales and alliance partners</span></li><br/>\n<li><span>Business development</span></li><br/>\n<li><span>Quota Achievement</span></li><br/>\n</ul><br/>\n</ul><br/>\n<p><strong> Responsibilities:</strong></p><br/>\n<ul><br/>\n<li><span>Manage a quota for both alliance opportunity and alliance influenced ARR</span></li><br/>\n<li><span>Assist direct sales account executives in closing deals by engaging alliance partners</span></li><br/>\n<li><span>Manage leading indicators to build an alliances pipeline 1-2 quarters out</span></li><br/>\n<li><span>Work with account executives to build an alliance engagement strategy by opportunity or by target account</span></li><br/>\n<li><span>Manage communications and activities for both internal and external resources</span></li><br/>\n</ul><br/>\n<p><span> </span><strong>Key Skill Sets Required:</strong></p><br/>\n<ul><br/>\n<li><span>Channel business development skills</span></li><br/>\n<li><span>Account and relationship management skills</span></li><br/>\n<li><span>Collaborating with Field Account Executives</span></li><br/>\n<li><span>3 - 5 years experience in an Alliances role</span></li><br/>\n</ul><br/>\n<p>N/A</p><div><br/>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p><br/>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p><br/>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p><br/>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p><br/>\n<p><strong></strong></p><br/>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p><br/>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div></p>",
         "name":"Partner Development Manager  - Southwest",
         "type":"external",
         "publication_date":"2021-05-17T11:08:06Z",
         "short_name":"partner-development-manager-southwest",
         "model_type":"jobs",
         "id":5834562,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/partner-development-manager-southwest"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Seeking candidates for our South region, located in one of the following cities: Tampa, Orlando, Miami, Atlanta, Nashville, Raleigh, Charlotte or Remote US </strong></p>\n\n<p>The Senior Success Manager is the primary link between Sprinklr and our customers. In this position, you will ensure that Sprinklr customers make the best possible use of the Sprinklr platform, equip them to pursue their strategic objectives, and help them achieve their desired business goals. </p>\n\n<p><strong>What You Will Do:</strong></p>\n\n<ul>\n<li>Empower Sprinklr enterprise customers to improve <em>their </em>customers’ digital experiences and achieve business objectives through the adoption of Sprinklr. </li>\n<li>Increase renewal rates, drive adoption, improve customer satisfaction, and cultivate Sprinklr advocates to generate new business. </li>\n<li>Serve as the internal voice of the customer and advocate for your clients’ needs (services, support, product management, executive alignment). </li>\n<li>Manage and track key performance indicators (KPIs) in Gainsight – including renewal and expansion commitments – to ensure exceptional, predictable results. </li>\n<li>Calculate risk forecasts based on product adoption; close renewal, upsell, and cross-sell opportunities within assigned client accounts in partnership with relevant Sales Account Executives – while achieving targeted renewal rate. </li>\n<li>Leverage knowledge of the Sprinklr platform and industry best practices to craft and present strategic solutions that ensure clients achieve their goals through product utilization and provide excellent consultative support. </li>\n<li>Identify opportunities for customer references and case studies. </li>\n<li>Deliver a significant individual contribution while collaborating with and strengthening teammates. </li>\n</ul>\n\n<p><strong>What We Are Looking for:</strong></p>\n\n<ul>\n<li>You have 3-7 years of relevant work experience in B2B SaaS customer success, account management, or a strategic consulting organization</li>\n<li>You have prior knowledge of (or willingness to learn) marketing and advertising technology</li>\n<li>You have comfort with preparing and delivering formal executive business reviews (EBR) to senior-level executives, with a focus on project-specific milestones and customer health</li>\n<li>You have experience using customer success software (ideally Gainsight), CRM software (ideally Salesforce), and Google Applications (Docs, Sheets, Slides)</li>\n<li>You have Clear verbal and written communication skills</li>\n</ul>\n\n<p><strong>What Makes You Qualified:</strong></p>\n\n<ul>\n<li>You have achieved a Bachelor’s degree from an accredited college or university, or relevant experience</li>\n<li>You are able to travel up to 30-40% of the time on average (can vary by region)</li>\n<li>You drive to continuously improve Client Services across the company by helping to create a company-wide culture focused on customer success and client delight across the organization (Marketing, Product, Sales, Finance, Executive)</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Senior Success Manager- South",
         "type":"external",
         "publication_date":"2021-04-23T23:13:33Z",
         "short_name":"senior-success-manager-south",
         "model_type":"jobs",
         "id":5293274,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/senior-success-manager-south"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span>Technical Product Marketing Director, Sprinklr Platform </span></p>\n\n<p><strong>The company: </strong></p>\n\n<p><span>Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. Customers are more connected and empowered than ever before. They want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand.  Sprinklr is a Customer Experience Management (CXM) platform helping the world’s most valuable enterprises make their customers happier. Learn more about our culture and how we make our employees happier through </span><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\"><span>The Sprinklr Way</span></a><span>. </span><span>When you join Sprinklr, you join a family of global talent from around the world who are dedicated to making the world a happier place!</span></p>\n\n<p><strong>The role: </strong></p>\n\n<p><span>Are you excellent at crafting narratives? Do you have a knack for storytelling? Are you great at creating high quality marketing deliverables that crisply convey value propositions? Do you get excited about diving into the technical details of a product? </span></p>\n\n<p><span>We’re looking for a Product Marketing Director to lead technical marketing for the Sprinklr platform. You will partner with Product Management, Sales, Customer Success, AR, PR, and others in Marketing to drive growth, connect with developers, build pipeline, support sales, increase adoption of our solutions, drive thought leadership, and highlight our points of differentiation to a technical audience. Responsibilities will include messaging and positioning, sales enablement, and creation of external and internal presentation materials, website copy, and other content.  </span></p>\n\n<p><span>This role will report to the VP of Platform Marketing, and can be fully remote or based out of our New York or San Francisco offices.</span></p>\n\n<p><strong>What You’ll Be Doing:</strong></p>\n\n<ul>\n<li><span>Lead the technical marketing and campaign strategy for Sprinklr’s platform</span></li>\n<li><span>Create content such as messaging documents, whitepapers, external and internal presentation materials, and website content</span></li>\n<li><span>Identify and create compelling customer stories </span></li>\n<li><span>Drive growth marketing initiatives to build pipeline and grow revenue </span></li>\n<li><span>Partner with product management to refine strategic positioning and go-to-market for new products, functions, and features</span></li>\n<li><span>Support sales with market expertise, competitive positioning, and ongoing training to communicate the value of Sprinklr’s offerings</span></li>\n<li><span>Partner with client success leaders to drive successful customer adoption and marketing campaigns</span></li>\n<li><span>Collaborate with analyst relations to provide ongoing support for inquiries, briefings, research reports, and more</span></li>\n</ul>\n\n<p><strong>What’s Required:</strong></p>\n\n<ul>\n<li><span>8+ years of relevant work experience in fields such as marketing, technical marketing, consulting, or product management</span></li>\n<li><span>A bachelor’s degree in business, communications, engineering, or related experience. MBA preferred</span></li>\n<li><span>Demonstrated ability to create powerful and engaging positioning and messaging</span></li>\n<li><span>Experience with bringing new products to market, agile release schedule, and other GTM activities</span></li>\n<li><span>Outstanding communication and presentation skills, both written and spoken</span></li>\n<li><span>Ability to succeed in a fast-paced environment, and easily transition from high level strategic thinking to creative and detailed execution</span></li>\n</ul>\n\n<p> </p>\n\n<p><strong>Why Sprinklr?</strong></p>\n\n<p><span>At Sprinklr, you will work with some of the best professional, sales, and engineering talent (including one of the world-leading AI teams) in the world. Your career will be challenging and rewarding with the opportunity for you to be at your best — both personally, and professionally.</span></p>\n\n<ul>\n<li><span> Create – and influence – how global brands build their experiences</span></li>\n<li><span> Passionate colleagues who play to win: through collaboration, hard work, and great ideas</span></li>\n<li><span> Global experience: Sprinklr has offices around the world including NY, San Francisco, London, Paris, Tokyo, Singapore, Dubai, Delhi.</span></li>\n<li><span> A fun, open working environment that creates a dynamic learning experience for everyone</span></li>\n</ul>\n\n<p><br><br><br><br><br><br><br><br></p>\n\n<p><span>Why you'll love Sprinklr: We're committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. We offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n\n<p> </p>\n\n<p><span>We focus on our mission: We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world's most loved enterprise software company, ever.</span></p>\n\n<p> </p>\n\n<p><span>We believe in our product: Sprinklr was built from the ground up to enable a brand's digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n\n<p> </p>\n\n<p><span>For the fifth consecutive year, Sprinklr has been named to the Forbes Cloud 100, the definitive ranking of the top 100 private cloud companies in the world. We were also named a 2020 Gartner Peer Insights Customers' Choice for Social Marketing Management. And in 2019, Sprinklr was the only leader in the Forrester Research, Inc. report, The Forrester Wave: Social Suites.</span></p>\n\n<p> </p>\n\n<p><span>We invest in our people: At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n\n<p> </p>\n\n<p><span>EEO - Our philosophy: Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we're more innovative, creative, and successful.</span></p>\n\n<p> </p>\n\n<p><span>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</span></p>\n\n<p> </p>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Director - Platform Marketing",
         "type":"external",
         "publication_date":"2021-05-13T23:11:01Z",
         "short_name":"director-platform-marketing-23ee98",
         "model_type":"jobs",
         "id":5801488,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            {
               "name":"Marketing"
            }
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/director-platform-marketing-23ee98"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p>We currently have a great opportunity for an Inside Sales Representative to join our motivated and creative Inside Sales team. You'll be responsible for creating interest and developing conversations with contacts at enterprise corporations. Team members are passionate about the ongoing transformation of inside sales to something that is personal, value-filled, and representative of social disruption.</p>\n\n<p><strong>What You’ll Do:</strong></p>\n\n<ul>\n<li>You will actively seek out new sales leads and business opportunities through active networking and sending personal, strategic, value-add emails, calls and social messages (no copying and pasting)</li>\n<li>You will be able to quickly research a company, identify opportunities, and strategise an approach to create interest</li>\n<li>You will profile potential prospects based on predetermined criteria</li>\n<li>You will be required to successfully close high volume deals</li>\n</ul>\n\n<p><strong>Who You Are &amp; What Makes You Qualified:</strong></p>\n\n<ul>\n<li>Desire to be in software sales (full cycle) position </li>\n<li>Have a verifiable track record of success and goal attainment in a sales oriented role</li>\n<li>Have a passion for technology and disruptive technology</li>\n<li>Have a deep understanding of the role social media plays in business</li>\n<li>Have 1-3 years in an Inside Sales/SDR role</li>\n<li>You have a run-through-a-brick-wall level of drive, passion, and desire for results</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Enterprise Sales Development Representative",
         "type":"external",
         "publication_date":"2021-04-20T23:15:17Z",
         "short_name":"enterprise-sales-development-representative-fc8447",
         "model_type":"jobs",
         "id":5576058,
         "locations":[
            {
               "name":"London, United Kingdom"
            }
         ],
         "categories":[
            {
               "name":"Sales"
            }
         ],
         "levels":[
            {
               "name":"Mid Level",
               "short_name":"mid"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/enterprise-sales-development-representative-fc8447"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Value Consultant - Remote PST/CST Timezone Required </strong></p>\n\n<p><strong>Who You Are</strong></p>\n\n<ul>\n<li><span>At least five years experience in business analysis and or/consulting role focused in digital media, advertising, technology, e-commerce of internet-based services</span></li>\n<li><span>Experience building financial and/or economic models</span></li>\n<li><span>An excellent verbal and written communicator with attention to detail</span></li>\n<li><span>Experience presenting data and findings to clients and/or executive audiences</span></li>\n<li><span>A self-starter with demonstrated flexibility and creativity when facing challenging problems or projects; ability to adjust to changing priorities of a quarterly cycle</span></li>\n<li><span>Highly analytical and well-organized, in both thought process and mindset</span></li>\n<li><span>A storyteller, passionate about helping customer identify and activate strategic business objectives</span></li>\n<li><span>Collaborative and open; hungry for feedback and mentoring</span></li>\n<li><span>Passionate, innovative, and avidly curious about deriving insights from data</span></li>\n<li><span>Comfortable with juggling multiple projects at one time and prioritizing as needed</span></li>\n<li><span>Right / left brain balanced</span></li>\n<li><span>Undergraduate degree in business, economics, and/or field focused on quantitative analysis (e.g. mathematics, engineering, sciences) preferred, but not required</span></li>\n</ul>\n\n<p><strong>What We Need</strong></p>\n\n<p><span>The Business Value Consulting team plays an essential role at Sprinklr, as the quantitative experts of the Solutions Consulting branch. Business Value Consultants split their time between:</span></p>\n\n<p><span>1) Managing/updating proprietary business value tool </span></p>\n\n<p><span>2) Providing consultative/strategic support and business value training for sales </span></p>\n\n<p><span>3) Engaging with account teams on specific opportunities to deliver Business Value Assessments</span></p>\n\n<p><span>4) Owning all financial modeling / value quantification for the business via maintaining close relationships with Product, Success, Product Marketing &amp; greater Solutions Consulting team</span></p>\n\n<p><span>In other words, the team’s mandate is to enable the field to quantify the business value Sprinklr can provide for prospects by understanding the current state of operations and articulating the quantitative &amp; qualitative benefits of moving to Sprinklr’s product suite.</span></p>\n\n<p><span>Value Consultants occasionally partner with Business Value Group Director counterparts on strategic accounts and initiatives, including but not limited to, bespoke financial modeling, change management strategies, customer journey mapping, and in-person and virtual executive presentations. Value Consultants  are expected to contribute and run with ideas for novel, meaningful organizational initiatives and collaborate on thought leadership and market analysis.</span></p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li><span>Master of Sprinklr product suite with ability to constantly iterate and improve our value model, including ideating new formulas as new features are rolled out</span></li>\n<li><span>Act as a key member of the account team with Sales, Success &amp; BVG for our enterprise and mid-market customers</span></li>\n</ul>\n\n<ul>\n<li><span>Manage &amp; update proprietary business value tool to enable sales to build business cases with value quantification</span></li>\n<li><span>Train sales &amp; success on proprietary value </span></li>\n</ul>\n\n<ul>\n<li><span>Create compelling presentations and collateral that demonstrate our solutions and the value proposition provided against a customer’s required capabilities</span></li>\n<li><span>Attend client meetings and conduct in-depth discovery on prospect’s current and future states primary business use cases, and positive business outcomes</span></li>\n<li><span>Conduct custom Business Value Assessments that leverage data from customer &amp; prospect interviews, Sprinklr platform data, industry and academic research, and Sprinklr client efficiencies</span></li>\n<li><span>Present results of Business Value Assessments clearly to a broad range of audiences and answer questions about research confidently</span></li>\n<li><span>Lead strategic internal projects related to Sprinklr’s value framework and measurement</span></li>\n<li><span>Keep up with aggressive training schedule &amp; maintain up-to-date Sprinklr product certifications</span></li>\n<li><span>Subject Matter Expert of one of Sprinklr’s core 5 product; cross-team collaboration with Product, Success, Product Marketing &amp; greater Solutions Consulting team</span></li>\n</ul>\n\n<p><strong> Why You'll Love Sprinklr:</strong> We offer a flexible work environment, unlimited vacation, and generous pay and benefits packages. While we have some amazing perks, at the end of the day, Sprinklrites are here for the opportunity to grow, learn, and affect the industry with incredible ingenuity. #Sprinklrlife</p>\n\n<p><strong>We focus on our mission: </strong> We believe social technology is the future of customer-brand relations across all departments, and we seek to make each of those experiences excellent at every touchpoint. This is how we all make the world more socialÑtogether.</p>\n\n<p><strong>We invest in our people</strong> - Sprinklrites passionately, genuinely care about seeing one another succeed in making an impact on the industry. We pride ourselves on having an honest, open environment and a supportive culture where we can take risks together.</p>\n\n<p><strong>We believe in our product</strong> - Sprinklr is the most complete enterprise social technology in the world, and we're not just saying thatÑForrester Wave said it for us! As such, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</p>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Value Consultant",
         "type":"external",
         "publication_date":"2021-04-20T23:15:19Z",
         "short_name":"value-consultant",
         "model_type":"jobs",
         "id":5603857,
         "locations":[
            {
               "name":"Austin, TX"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"Mid Level",
               "short_name":"mid"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/value-consultant"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Success Enablement Manager - Delivery</strong></p>\n\n<p><span>Reports To: Director, Sales Enablement Delivery</span></p>\n\n<p><span>Location: Remote </span></p>\n\n<p><span>This Success Enablement Manager role is on the Field Enablement &amp; Productivity team and supports  Sprinklr’s Success organization. You will also be responsible for delivering programs for our Success Manager new hires, and enable them throughout their Sprinklr tenure.</span></p>\n\n<p><span>This role requires the individual to use operational excellence at all times when collaborating with the broader Sales Enablement team. You will set an example for the greater sales and success organization, especially new hires, on how to speak about Sprinklr’s value. The ideal candidate will have a strong love for the product, and be able to connect features and function capability to building value for current clients, focusing on retention and renewals.</span></p>\n\n<p><span>Candidates for this role must possess a growth mindset and love to help others succeed. A support role (and team) of the highest order, we are constantly thinking of creative ways to serve our new and tenured Field teams.</span></p>\n\n<p><span>New Hire Onboarding Responsibilities:</span></p>\n\n<p><span>This role is based on the Success Onboarding Process, which represents the foundation for their success at Sprinklr.  Responsibilities associated with this role include: </span></p>\n\n<ul>\n<li><span>Deliver compelling instructor-led Sprinklr training sessions that ensure consistency and clarity in Sprinklr value and differentiators. Candidate should be able to deliver both virtual and on-site* synchronous trainings. *when travel resumes.</span></li>\n<li><span>Design and support the curriculum of the Success enablement program around product messaging, including developing programs beyond Instructor-led Training, such as asynchronous eLearning and other blended learning approaches, which will enable the Success Organization to reach their productivity metrics.</span></li>\n<li><span>Leverage, optimize, and expand Sprinklr’s existing certification process for Success onboarding, ensuring that SMs are equipped with the process and technical skills and potentially expand to other roles.</span></li>\n<li><span>Assist in the management of various Field Enablement programs across the sales functions. This may include instructor-led trainings, webinars, eLearning assignments, conferences, etc.</span></li>\n<li><span> Work with field leadership and the greater enablement team to develop and continuously assess program priorities, ensuring the effective communication of KPIs and LI's to SM's.</span></li>\n</ul>\n\n<p> </p>\n\n<p><span>Tenured Responsibilities:</span></p>\n\n<p><span>For our tenured salesforce, there are major opportunities for growth both at the team level and at the individual level.  </span></p>\n\n<ul>\n<li><span>Identify product opportunities where tenured SMs are having the most challenges. Design and develop scalable development programs, while also facilitating some of these sessions, during office Mondays and team events.</span></li>\n<li><span>Deliver spot programs as necessary to support tenured SMs with new product messaging, and how it can be delivered in an impactful way to their customers</span></li>\n<li><span>Provide in-field coaching to SMs, augmenting leadership support as needed.</span></li>\n</ul>\n\n<p><span>Preferred Skills:</span></p>\n\n<ul>\n<li><span>Advanced Proficiency in: Google Slides, Docs, Sheets.</span></li>\n<li><span>Microsoft Office: Word, Powerpoint</span></li>\n<li><span>Advanced writing and grammar skills (English)</span></li>\n<li><span>Adult Learning Theory: understand how adults learn and best retain information</span></li>\n<li><span>Enterprise Sales Processes: write and strategize from an enterprise sales point of view</span></li>\n</ul>\n\n<p><span>Experience: 3+ years Success Management background. Former sales background a plus!</span></p>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Enablement Program Manager - Customer Success",
         "type":"external",
         "publication_date":"2021-05-18T23:12:55Z",
         "short_name":"enablement-program-manager-customer-success-10cfc8",
         "model_type":"jobs",
         "id":5810592,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"Mid Level",
               "short_name":"mid"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/enablement-program-manager-customer-success-10cfc8"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span>The Director, Global Benefits is responsible for the development, implementation, and management of Sprinklr’s benefit and wellness programs globally. Reporting to the VP, Global Total Rewards, the Director will provide leadership in scaling the health, wellness, and retirement benefits program as Sprinklr scales, and contribute to the overall strategic direction and alignment of all benefit programs with Sprinklr’s Total Rewards strategy.</span><span><br></span><span><br></span><strong>Roles and Responsibility (list in order of importance)</strong></p>\n\n<p> </p>\n\n<ul>\n<li><span>Manage and lead the implementation, oversight and management of benefits and wellness programs, policies, plans and processes globally. </span></li>\n<li><span>Develop and implement best in class programs to support the changing needs of the organization and its employees, in alignment with Sprinklr Global Total Rewards philosophy.</span></li>\n<li><span>Develop tools and communication vehicles that increase employee engagement and understanding of global benefit programs and the value they deliver.</span></li>\n<li><span>Work closely with brokers globally to evaluate and benchmark Sprinklr’s benefits programs based on global market trends and best practices.</span></li>\n<li><span>Provide thought leadership, expertise, and guidance in the development of innovative wellness programs.</span></li>\n<li><span>Oversee M&amp;A due diligence, resource planning and integration activities for the benefits function.</span></li>\n<li><span>Ensure compliance with global and local requirements such as ACA, ERISA and HIPAA and other state and federal requirements as needed.</span></li>\n<li><span>Work closely with internal business partners and broker partners to track benefits spend and analyze trends for all lines of coverage, including self-funded plans.</span></li>\n<li><span>Drive and manage benefit annual renewals and enrollment process, involved in all phases of renewal discussions, benefits communication plan, conducting employee meetings, etc.</span></li>\n<li><span>Oversee US leave management reporting, vendor management, policies and partnering closely with Legal and Culture &amp; Talent teams.</span></li>\n<li><span>Lead/participate in ad hoc projects and duties, as assigned.</span><span><br></span><span><br></span><strong>Required Qualifications</strong><span><br></span><span><br></span><strong>Years of Experience in Related Field:</strong><span> 12 years of experience in benefits at a global scale</span><span><br></span><span><br></span><strong>Education:</strong><span> Bachelor’s degree or equivalent</span><span><br></span><span><br></span><strong>Technical/Specialized Knowledge, Skills, and Abilities:</strong></li>\n</ul>\n\n<p> </p>\n\n<ul>\n<li><span>Alignment with The Sprinklr Way, our guide to operating and working at Sprinklr.</span></li>\n<li><span>Excellent interpersonal, organizational, and influencing skills.</span></li>\n<li><span>Strong written and verbal communication with high attention to detail.</span></li>\n<li><span>Desire to interact with individuals from other countries and cultures and provide excellent customer service.</span></li>\n<li><span>Proven ability to work efficiently, both independently and as a contributing member of the Culture &amp; Talent team, and various other internal departments.</span></li>\n<li><span>High levels of flexibility and time management. Ability and willingness to accommodate calls with different time zones.</span></li>\n<li><span>Seasoned experience with data management and analysis.</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Director, Global Benefits",
         "type":"external",
         "publication_date":"2021-04-20T23:15:17Z",
         "short_name":"director-global-benefits-b9fee7",
         "model_type":"jobs",
         "id":5598959,
         "locations":[
            {
               "name":"Flexible / Remote"
            },
            {
               "name":"New York, NY"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/director-global-benefits-b9fee7"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Role: Sr. Sales Operations Analyst - Product</strong></p>\n\n<p><em><span>Location: New York City or East Coast</span></em></p>\n\n<p><strong>Who We Are</strong></p>\n\n<p><span>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises, helping the world’s most valuable companies make their customers happier.  Sprinklr is 2,000 employees strong, valued at $2.7 billion, and positioned at the forefront of the customer experience management industry. At a time when consumers are connected and empowered like never before, Sprinklr is helping the world’s largest brands provide immediate, personalized and consistent experiences at every turn. </span></p>\n\n<p><span>Sprinklr offers a set of powerful social capabilities that allow our clients to reach, engage, and listen to customers across 24 social channels. We empower entire organizations to work together – across marketing, advertising, research, commerce, and customer care – to manage customer experience at scale. Sprinklr works with more than 1,000 of the most recognized brands around the world, including Nike, JPMorgan Chase, Verizon, McDonald’s, Microsoft, P&amp;G, and more than 50% of the Fortune 50.</span></p>\n\n<p><strong>What You'll Do</strong></p>\n\n<p><span>We are looking for an experienced business and operations analyst to work closely with our Sales and Product teams to provide valuable insights into product line and business unit performance. </span><span>As a part of the Worldwide Sales and Success Operations team, this individual will drive the effectiveness and efficiency of our Sales and Product organizations by becoming a product-data forecasting, pipeline, churn, and trend expert. </span><span>We have a strong culture of data-driven decision making at Sprinklr and this individual, in collaboration with the rest of the Worldwide Operations team will function as a center of expertise for the Sales and Product organizations.</span></p>\n\n<p><span>You will ensure that the organization is enabled with the analytical insights, systems, tools and process needed to succeed and achieve business goals around product reporting and product-focused selling. You will own product line performance reporting to all Product, Sales, and Customer Success teams, in addition to the Executive team.</span></p>\n\n<p><strong>What You Will be Responsible for </strong></p>\n\n<ul>\n<li><span>Reporting and analysis delivered to leaders of business unit/product/engineering teams detailing business results, forecast performance, and meaningful business trends through visual and numerical dashboards and presentations</span></li>\n<li><span>Proactively extracting and synthesizing data to influence leaders and provide strategic recommendations</span></li>\n<li><span>Embracing complex business problems and become an expert in business unit, product line and engineering initiatives</span></li>\n<li><span> </span><span>Developing recommendations for new business processes and initiatives to support improvements in business units/product/engineering</span></li>\n<li><span>Partnering with cross-functional teams on business initiatives that impact systems, reporting, policies, and process improvements</span></li>\n<li><span>Translating business initiatives into actionable objectives by developing, coordinating, and implementing a plan then measuring the overall impact and success</span></li>\n</ul>\n\n<p> </p>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li><span>BA/BS or equivalent experience</span></li>\n<li><span>3+ years of related experience</span></li>\n<li><span>Experience across one or all of the following operations functional areas: Sales, Product</span></li>\n<li><span>Background in SaaS or a recurring customer subscription model company</span></li>\n<li><span>Experience using CRM Software, BI Tools and Google Applications</span></li>\n<li><span>A strong sense of urgency and ability to work in a fast paced environment with sound business judgment and a focus on problem solving</span></li>\n<li><span>Exceptional communication skills including ability to communicate new concepts when interfacing with Sales and Product teams and Business Leaders</span></li>\n<li><span>Effectively manages many priorities across the organization and adjust as priorities change</span></li>\n<li><span>Experience with data management and an understanding of data transformation and visualization techniques to drive insights and data-driven decision making</span></li>\n<li><span>Experience with tools such as Domo, Tableau, SQL, Excel</span></li>\n</ul>\n\n<p><strong>Skills:</strong></p>\n\n<ul>\n<li><span>Ability to bring together multiple sources of data and generate insights and business recommendations </span></li>\n<li><span>Ability to thrive in a fast-paced, rapidly-changing environment and work under tight deadlines to prioritize multiple deliverables and responsibilities</span></li>\n<li><span>Interprets business issues and recommends best practices and innovative solutions</span></li>\n<li><span>Detail-oriented and able to maintain a high level of ownership and accuracy</span></li>\n<li><span>Communication skills and an ability to partner effectively across the organization from the individual contributor to senior leadership level</span></li>\n<li><span>Experience leading the ideation, planning, and implementation of business processes to enable more effective operations</span></li>\n<li><span>High standards of accuracy and precision</span></li>\n<li><span>Ability to think creatively and problem solve; highly-driven and self-motivated</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Sr. Sales Operations Analyst - Product",
         "type":"external",
         "publication_date":"2021-04-22T23:33:01Z",
         "short_name":"sr-sales-operations-analyst-product-72c9a6",
         "model_type":"jobs",
         "id":5683617,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/sr-sales-operations-analyst-product-72c9a6"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span>This Program Manager role serves the Field Enablement team at Sprinklr. The “field” consists of all Sprinklrites who engage with our clients such as: Account Executives, SDRs, Solution Consultants, and post-sales roles like Professional Services, Implementation Consultants, and Success Managers. </span></p>\n\n<p><span>We are looking for a Program Manager with experience managing enablement or Learning and Development programs </span><span>through a virtual format</span><span>. This position will be responsible for managing field enablement programs, facilitating development sessions, instituting virtual-delivery best practices, and designing various enablement content to support our peers, specifically through a virtual delivery medium. This candidate should have some experience participating in designing, developing, and facilitating virtual conferences or performances.</span></p>\n\n<p><span>The ideal candidate will be well-rounded, possessing advanced writing, presentation, and organization skills. They will be asked to build and maintain relationships across Sprinklr to limit barriers and help communicate up-to-date information to our field teams. More than just a Project Manager, this position will be responsible for developing, designing, and managing onboarding programs, ongoing workshops, enablement events, and development sessions. Additionally, this candidate should work well in a team environment. This is a highly collaborative role where you’re not always right! As is the case with most Enablement teams, we expect all members of our team to pitch in and help get the job done - even if it’s out of your comfort zone.</span></p>\n\n<p><span>Candidates for this role must possess a growth mindset and love to help others succeed. A support role (and team) of the highest order, we are constantly thinking of creative ways to serve our new and tenured Sales teammates.</span></p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li><span>Manage designated field onboarding programs with your delivery counterpart.</span></li>\n<li><span>Work closely with SMEs to develop enablement sessions and content.</span></li>\n<li><span>Develop program collateral for your field enablement programs.</span></li>\n<li><span>Craft compelling messaging derived from the Sprinklr playbook, to ensure consistency and clarity, while instilling confidence from our internal customers (field teams).</span></li>\n<li><span>Draft scripts for messaging playbooks, video content, presentations, slideware, etc.</span></li>\n<li><span>Design Sprinklr Onboarding content &amp; curriculum to meet and improve upon the teams’ ramping goals and leading indicators.</span></li>\n<li><span>Create compelling slideware to present important information at scale.</span></li>\n<li><span>Support Field Delivery Enablers (ILT) with design, curriculum, and strategy for each ILT course owned by Sales Enablement.</span></li>\n<li><span>Project manage various Field Enablement initiatives (programs) during each fiscal quarter.</span></li>\n<li><span>Manage, coordinate, and facilitate the enablement sessions for yearly field and leadership summits.</span></li>\n<li><span>Design eLearning content and collateral for Sales and Sprinklr field members.</span></li>\n<li><span>Edit and manage video recordings from meetings, role plays, and training seminars to host in our LMS/CMS.</span></li>\n</ul>\n\n<p><strong>Preferred Skills:</strong></p>\n\n<p><span>Design: Google Slides; Powerpoint, Adobe creative suite, Video capture, Video editing, Instructional design a plus!</span></p>\n\n<p><span>Copywriting: Advanced writing and grammar skills (English), professional email and messaging etiquette.</span></p>\n\n<p><span>Presentation: Ability to stand and deliver material for which you are not a subject matter expert. Ability to present effectively to senior leaders and key stakeholders. Comfortable presenting to large audiences.</span></p>\n\n<p><span>Adult Learning Theory: Understand how adults learn and best retain information.</span></p>\n\n<p><span>Enterprise Sales Acumen: write, strategize, and deliver information from a Sales point of view</span></p>\n\n<p><strong>Experience:</strong></p>\n\n<p><span>3+ years in Field Enablement</span></p>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Program Manager, Field Enablement",
         "type":"external",
         "publication_date":"2021-05-04T23:13:32Z",
         "short_name":"program-manager-field-enablement-41f403",
         "model_type":"jobs",
         "id":5761047,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/program-manager-field-enablement-41f403"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Description </strong></p>\n\n<p>At a time when consumers are connected and empowered like never before, Sprinklr is helping the world's largest brands provide amazing experiences at every turn. Sprinklr offers a set of powerful social capabilities that allow our clients to reach, engage, and listen to customers across 24 social channels. We empower entire organizations to work together across social, marketing, advertising, research, and customer care to manage customer experience at scale. Most exciting, Sprinklr works with 50% of the Fortune 500 and nine of the world's 10 most valued brands, including McDonald's, Nestle, Nike, LG, P&amp;G, Shell, Samsung, and Visa. </p>\n\n<p>At Sprinklr, we're customer-obsessed, treat one another like family, and take extreme pride in who we are and what we're building it is core to who we are as a company. </p>\n\n<p><strong>Meet our Sales Team</strong></p>\n\n<p>An Enterprise Sales Team that is on a mission to be the best sales team there is. Every member of the team is passionate about social media and showing enterprise organisations how it can impact their business for the best, when they have the right infrastructure.  </p>\n\n<p><strong>What You’ll Do:</strong></p>\n\n<ul>\n<li>You will be identifying, negotiating and closing big deals in a defined territory. You will be working with CMOs and CTOs of some of the biggest brands in the world. You will be working with them to build solutions that allow them to win. <strong>We are customer obsessed.</strong></li>\n<li>You will be called upon to utilize superior salesmanship to develop sales opportunities and identify the necessary decision makers and influencers of the prospective deal.  <strong>We believe it is OK, be fearless.</strong></li>\n<li>You will listen, identify and understand clients/prospective clients needs and deliver to their expectations. You will be able to build relationships with multiple stakeholders and influence them in a positive way.  <strong>Helping others succeed makes us happy. </strong></li>\n<li>You will actively seek out new sales leads and business opportunities through active networking and utilizing business referrals. <strong>We passionately, genuinely care.  </strong></li>\n<li>You are hugely curious will constantly look for ways to enhance your knowledge of our industry, market, and competitors to provide that sales edge needed to close business and generate revenue.  <strong>We believe that every human has the potential to be amazing. Keep learning. AND be curious: we are constantly looking for ways to enhance knowledge of our industry, market and competitors to provide the sales edge to close business and generate revenue.  </strong></li>\n<li>You will seek feedback at every opportunity so you can be the best you can be. You will seek this from leaders, peers and clients. <strong>We do the right thing always and take extreme pride in who we are, what we build and what we do. AND, we are led by character.</strong></li>\n</ul>\n\n<p> </p>\n\n<p><strong>Who You Are &amp; What Makes You Qualified:</strong></p>\n\n<ul>\n<li>You are one to the top 10% of the sales people in your current company/division. You have a track record of being one of the best. You are someone who pursues your passions with energy and commitment. <strong> We never, ever give up.</strong></li>\n<li>You are incredibly smart (we are in a very fast moving industry and you have to be nimble of mind to keep up) and have a work ethic second to none.  <strong>Every human has the potential to be amazing. Keep learning. AND we are coachable.  </strong></li>\n<li>You’ve got 7+ years of enterprise software sales experience, meaning you’ve experienced the full range of obstacles when behind the wheel of creating a complex &amp; enterprise wide SaaS deals.  <strong>We are customer obsessed.</strong></li>\n<li>You’ve been successful in building relationships – Sprinklr is a best in class solution.. But we’ve succeeded because we genuinely care about how we make people feel. You share the same values, know that relationships are everything and have the ability to use these to identify and develop new business opportunities. <strong>We passionately, genuinely care.</strong></li>\n<li>You love the Customer Experience revolution! It’s not just social, it’s the entire relationship between global brands and consumers that’s changing, and as social interactions evolve in importance, Sprinklr is right in the middle of it. Your desire and ability to embrace this change and understand how social media platforms can impact the various functions of a large organization is critical.  <strong>We do the right thing always, and take extreme pride in who we are, what we build and what we do.  </strong></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Enterprise Account Executive",
         "type":"external",
         "publication_date":"2021-04-20T23:15:17Z",
         "short_name":"enterprise-account-executive-a2999e",
         "model_type":"jobs",
         "id":5091685,
         "locations":[
            {
               "name":"Sydney, Australia"
            }
         ],
         "categories":[
            {
               "name":"Sales"
            }
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/enterprise-account-executive-a2999e"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span>The Sr. Sales Incentives Specialist will be responsible for supporting the functions associated with the global incentives (commission) accruals and payout calculations.  This includes all groups who earn commissions (monthly, quarterly, and annually).  </span></p>\n\n<h3><span><strong>If you have Sales Commission, Incentive Plan &amp; Xactly experience </strong></span></h3>\n\n<h3><span><strong>email me at: <a href=\"mailto:Janice.Ceresa@Sprinklr.com\">Janice.Ceresa@Sprinklr.com</a> </strong>   </span></h3>\n\n<h3><span><strong>put in the subject line: Xactly</strong></span></h3>\n\n<p><strong>Job Responsibilities</strong></p>\n\n<ul>\n<li><span>Support the day-to-day administration of incentive compensation plans for all eligible employees (globally), including, but not limited to: maintaining employee and plan data in Xactly, updating applicable quotas and targets, and updating territory changes.</span></li>\n<li><span>Coordinate with the other members of the global incentives team on the calculation of the monthly commission accruals (across all commissionable group), as well as on the monthly commission payout calculations.</span></li>\n<li><span>Assist with the distribution and tracking of individual Compensation Plans and reporting on Attainment to quota / target.</span></li>\n<li><span>Provide proactive analytics on sales incentives results, including budget vs. actual variances.</span></li>\n<li><span>Respond to issues and questions concerning incentive plan payments and policies.</span></li>\n<li><span>Work with incentives system consultants on integrations, reporting and system updates, including testing in sandbox instance.</span></li>\n<li><span>Support the ongoing review, evaluation, and modeling of new or updated sales incentive programs.</span></li>\n<li><span>Coordinate the maintenance of documentation for all commission-related processes.</span></li>\n<li><span>Work on ad-hoc projects as needed and seek continuous process improvements and automation.</span> </li>\n</ul>\n\n<p><strong>Job Requirements</strong></p>\n\n<ul>\n<li><span>Prior SAAS-based company and commission structures experience </span><strong>preferred.</strong></li>\n<li><span>Experience with incentives software applications </span><strong>a must</strong><span>. Xactly preferred.</span></li>\n<li><span>Knowledge of accruals and compliance with ASC 606 commission accounting</span></li>\n<li><span>5+ years of experience in a sales operations/finance role supporting sales incentive (commission) plan operations.</span></li>\n<li><span>2+ years of experience with Salesforce</span></li>\n<li><span>Comfortable partnering and engaging with cross-functional teams.</span></li>\n<li><span>Extreme attention to detail and ability to think quickly.</span></li>\n<li><span>Excellent interpersonal and communication skills (both verbal and written) with a willingness to appropriately debate difficult issues.</span></li>\n<li><span>Ability to excel in a fast-paced environment delivering accurate information while managing to deadlines where adaptability is imperative.</span></li>\n<li><span>Intermediate to Advanced knowledge of Microsoft Excel, including pivot tables, v-lookups and data analysis</span></li>\n<li><span>Bachelor’s degree in Accounting, Finance, Business Administration or another field that uses quantitative analysis.</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Sr. Sales Commissions Analyst",
         "type":"external",
         "publication_date":"2021-04-30T23:20:03Z",
         "short_name":"sr-sales-commissions-analyst",
         "model_type":"jobs",
         "id":5568840,
         "locations":[
            {
               "name":"New York, NY"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/sr-sales-commissions-analyst"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>Role: Sr. Sales Operations Analyst - Product</strong></p>\n\n<p><em><span>Location: New York City or East Coast</span></em></p>\n\n<p><strong>Who We Are</strong></p>\n\n<p><span>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises, helping the world’s most valuable companies make their customers happier.  Sprinklr is 2,000 employees strong, valued at $2.7 billion, and positioned at the forefront of the customer experience management industry. At a time when consumers are connected and empowered like never before, Sprinklr is helping the world’s largest brands provide immediate, personalized and consistent experiences at every turn. </span></p>\n\n<p><span>Sprinklr offers a set of powerful social capabilities that allow our clients to reach, engage, and listen to customers across 24 social channels. We empower entire organizations to work together – across marketing, advertising, research, commerce, and customer care – to manage customer experience at scale. Sprinklr works with more than 1,000 of the most recognized brands around the world, including Nike, JPMorgan Chase, Verizon, McDonald’s, Microsoft, P&amp;G, and more than 50% of the Fortune 50.</span></p>\n\n<p><strong>What You'll Do</strong></p>\n\n<p><span>We are looking for an experienced business and operations analyst to work closely with our Sales and Product teams to provide valuable insights into product line and business unit performance. </span><span>As a part of the Worldwide Sales and Success Operations team, this individual will drive the effectiveness and efficiency of our Sales and Product organizations by becoming a product-data forecasting, pipeline, churn, and trend expert. </span><span>We have a strong culture of data-driven decision making at Sprinklr and this individual, in collaboration with the rest of the Worldwide Operations team will function as a center of expertise for the Sales and Product organizations.</span></p>\n\n<p><span>You will ensure that the organization is enabled with the analytical insights, systems, tools and process needed to succeed and achieve business goals around product reporting and product-focused selling. You will own product line performance reporting to all Product, Sales, and Customer Success teams, in addition to the Executive team.</span></p>\n\n<p><strong>What You Will be Responsible for </strong></p>\n\n<ul>\n<li><span>Reporting and analysis delivered to leaders of business unit/product/engineering teams detailing business results, forecast performance, and meaningful business trends through visual and numerical dashboards and presentations</span></li>\n<li><span>Proactively extracting and synthesizing data to influence leaders and provide strategic recommendations</span></li>\n<li><span>Embracing complex business problems and become an expert in business unit, product line and engineering initiatives</span></li>\n<li><span> </span><span>Developing recommendations for new business processes and initiatives to support improvements in business units/product/engineering</span></li>\n<li><span>Partnering with cross-functional teams on business initiatives that impact systems, reporting, policies, and process improvements</span></li>\n<li><span>Translating business initiatives into actionable objectives by developing, coordinating, and implementing a plan then measuring the overall impact and success</span></li>\n</ul>\n\n<p> </p>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li><span>BA/BS or equivalent experience</span></li>\n<li><span>3+ years of related experience</span></li>\n<li><span>Experience across one or all of the following operations functional areas: Sales, Product</span></li>\n<li><span>Background in SaaS or a recurring customer subscription model company</span></li>\n<li><span>Experience using CRM Software, BI Tools and Google Applications</span></li>\n<li><span>A strong sense of urgency and ability to work in a fast paced environment with sound business judgment and a focus on problem solving</span></li>\n<li><span>Exceptional communication skills including ability to communicate new concepts when interfacing with Sales and Product teams and Business Leaders</span></li>\n<li><span>Effectively manages many priorities across the organization and adjust as priorities change</span></li>\n<li><span>Experience with data management and an understanding of data transformation and visualization techniques to drive insights and data-driven decision making</span></li>\n<li><span>Experience with tools such as Domo, Tableau, SQL, Excel</span></li>\n</ul>\n\n<p><strong>Skills:</strong></p>\n\n<ul>\n<li><span>Ability to bring together multiple sources of data and generate insights and business recommendations </span></li>\n<li><span>Ability to thrive in a fast-paced, rapidly-changing environment and work under tight deadlines to prioritize multiple deliverables and responsibilities</span></li>\n<li><span>Interprets business issues and recommends best practices and innovative solutions</span></li>\n<li><span>Detail-oriented and able to maintain a high level of ownership and accuracy</span></li>\n<li><span>Communication skills and an ability to partner effectively across the organization from the individual contributor to senior leadership level</span></li>\n<li><span>Experience leading the ideation, planning, and implementation of business processes to enable more effective operations</span></li>\n<li><span>High standards of accuracy and precision</span></li>\n<li><span>Ability to think creatively and problem solve; highly-driven and self-motivated</span></li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Sr. Sales Operations Analyst - Product",
         "type":"external",
         "publication_date":"2021-04-20T23:15:19Z",
         "short_name":"sr-sales-operations-analyst-product-75a7cb",
         "model_type":"jobs",
         "id":5237144,
         "locations":[
            {
               "name":"Flexible / Remote"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"Senior Level",
               "short_name":"senior"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/sr-sales-operations-analyst-product-75a7cb"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><strong>What You'll Do:</strong></p>\n\n<ul>\n<li>Identify, comprehend and clearly articulate clients' requirements to generate an end-to-end advertising solution</li>\n<li>Analyse and elevate client’s consumption of contract, adoption of the product and generation of upsell or cross-sell</li>\n<li>Assist team in building social media advertising campaigns on Facebook, Instagram, Snapchat, Twitter, LinkedIn &amp; YouTube for world’s leading brands mapped to their business needs</li>\n<li>Analyse clients’ performance and prescribe methodologies for optimal budget management, faster growth, higher conversions and greater ads reach</li>\n<li>Collaborate with our technology partners to build expertise on the social media management software</li>\n<li>Provide an effective reporting mechanism for highlighting prime metrics and key performance indicators</li>\n<li>Identify opportunities for increased efficiency for clients and provide subject matter expertise on best fit across message, media &amp; channel</li>\n<li>Work with clients to improve the paid service itself and its alignment with client’s core business</li>\n<li>Track team members’ productivity and identify opportunities in processes for increasing efficiency</li>\n<li>Capturing development areas for product improvement and closed looping with product managers and engineering for necessary corrective actions</li>\n<li>Actively make sure that you are knowledgeable on all Sprinklr software products</li>\n<li>Actively make sure you are knowledgeable on native channel’s ad products package</li>\n</ul>\n\n<p><strong>Who You Are &amp; What Makes You Qualified:</strong></p>\n\n<ul>\n<li>6+ years of overall working experience with 4-6 years of experience in digital marketing, campaign execution experience in social platforms and social account management at a brand or agency</li>\n<li>Advanced excel skills with efficiency in using v-lookups, pivots, charts, data interpretation and handling high volumes of data sets</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Industry specific knowledge across different verticals or lines of business</li>\n<li>Analytical mind-set with attention to detail and excellent problem solving skills</li>\n<li>Ability to think independently and learn as a member of a team</li>\n<li>Intrinsically motivated to tackle unique client use cases, passion to solve business challenges and commitment to client delight</li>\n<li>Demonstrated experience and a passion for the social technology universe (i.e., Facebook, Twitter,YouTube, Instagram, LinkedIn)</li>\n<li>Direct experience in working with or for social media management software is preferred</li>\n<li>Social media ads certifications, like Facebook Blueprint, Google Adwords, etc are a must</li>\n<li>4-year college/university degree</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Platform Success Manager",
         "type":"external",
         "publication_date":"2021-04-20T23:15:18Z",
         "short_name":"platform-success-manager-b179c6",
         "model_type":"jobs",
         "id":5295430,
         "locations":[
            {
               "name":"Bengaluru, India"
            }
         ],
         "categories":[
            
         ],
         "levels":[
            {
               "name":"management",
               "short_name":"management"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/platform-success-manager-b179c6"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      },
      {
         "contents":"<div><p><span>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. </span><strong>Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier. </strong>Learn more about our culture and how we make our employees happier through <strong><a href=\"https://drive.google.com/file/d/1K4Ew4me9vA45eubIx7DhOjWK8C6xabsI/view\">The Sprinklr Way</a>.</strong></p></div>\n\n<p><span><strong>Recruiting Coordinator</strong></span></p>\n\n<p>As the world moves even more online due to the coronavirus pandemic, customers are connected and empowered like never before. Customers want an immediate, personalized and consistent experience, no matter which channel they choose to engage with a brand. Sprinklr helps brands meet the demands of today’s customers by providing them with the insights they need to make every interaction matter. Sprinklr is a Customer Experience Management (CXM) platform for modern enterprises with 2000+ employees helping the world’s most valuable enterprises make their customers happier.</p>\n\n<p>At a time when consumers are connected and empowered like never before, Sprinklr is helping the world's largest brands provide amazing experiences at every turn. Sprinklr offers a set of powerful social capabilities that allow our clients to reach, engage, and listen to customers across 24 social channels. We empower entire organizations to work together across social, marketing, advertising, research, and customer care to manage customer experience at scale. Most exciting, more than 75 of the world's 100 most valuable brands use Sprinklr to create epic customer experiences, including Microsoft, Cisco, McDonald's, Nestle, Nike, P&amp;G, Shell, Samsung, and Visa.</p>\n\n<p>At Sprinklr, we're customer obsessed, treat one another like family, and take extreme pride in who we are and what we're building -- it is core to who we are as a company. </p>\n\n<p>We are looking for a highly-driven and motivated Recruiting Coordinator to join our fast growing team based out of Gurugram/Bangalore. The Recruiting Coordinator will manage and support recruitment processes; respond to recruitment-related inquiries; perform data entry, track applicant status and ensure the resume/hiring database is updated and current. This person will work with Recruiters and Hiring Managers to coordinate and schedule interviews as requested. This person will support the candidate experience with travel preparations, itineraries, recommendations, etc., including greeting and hosting candidates on-site and ensuring they have a top notch candidate experience.</p>\n\n<p><strong>What You’ll Do</strong></p>\n\n<ul>\n<li>Elevate our candidate experience initiatives: Gain visibility and demonstrate accountability within the business by scheduling a high volume and complex phone, virtual and onsite interviews.</li>\n<li>Manage scheduling for interviews and communicating all interview logistics with candidates and interview teams including travel arrangements.</li>\n<li>Assist with new hire induction and on-boarding new employees including processing new hire formalities.</li>\n<li>Build strong partnerships with multiple recruiters, the hiring managers they support, and their candidates to drive an efficient process for providing a positive candidate experience, as well as handle any challenges that may occur.</li>\n<li>Collaborate with our Recruiting Operations team to improve upon and streamline existing processes and programs and develop innovative strategies around finding top talent.</li>\n<li>Maintain a clear recruiting workflow by updating candidate’s status in Applicant Tracking System</li>\n</ul>\n\n<p><strong>Who You Are &amp; What Makes You Qualified</strong></p>\n\n<ul>\n<li>1-2 years of professional experience, preferably in a coordinator role</li>\n<li>Excellent written and verbal communication skills</li>\n<li>Ability to multitask effectively and work in a startup environment</li>\n<li>Passion for working with others and collaborating as a team</li>\n<li>Flexibility and initiative—this role may require you to execute outside of regular business hours</li>\n<li>Ability to work with evolving systems and structures, demonstrating the flexibility/willingness to adapt to changing environments</li>\n<li>Experience in a coordination-heavy / client-services role</li>\n<li>Effective time management and prioritization skills</li>\n<li>To learn more about the values at Sprinklr please click here.</li>\n</ul>\n\n<div>\n<p><strong>Why you'll love Sprinklr:</strong><span> We’re committed to creating the kind of culture where you feel like you belong, are happier today than yesterday, and your contributions matter. At Sprinklr, our goal is to treat everyone like family and passionately, genuinely care. For full-time employees, we offer flexible paid time off and paid parental leave, medical plans, dental and vision plans, life insurance, 401(k) savings plans, employee stock options, gym and wellness discounts, Plum benefits, Lifemart discounts, and paid time off to invest in learning and career development.</span></p>\n<p><strong>We focus on our mission:</strong><span> We founded Sprinklr with one mission: to enable every organization on the planet to make their customers happier. Our vision is to be the world’s most loved enterprise software company, ever.</span></p>\n<p><strong>We believe in our product:</strong> <span>Sprinklr was built from the ground up to enable a brand’s digital transformation. Its platform provides every customer-facing team with the ability to reach, engage and listen to customers around the world. </span><span>At Sprinklr, we have many of the world's largest brands as our clients, and our employees have the opportunity to work closely alongside them.</span></p>\n<p><strong>We invest in our people:</strong><span> </span><span>At Sprinklr, we believe every human has the potential to be amazing. We empower each Sprinklrite in the journey toward achieving their personal and professional best. For wellbeing, this includes daily meditation breaks, virtual fitness, and access to Headspace. </span><span>We have continuous learning opportunities available with Audible for Business, LinkedIn Learning, and more.</span></p>\n<p><strong></strong></p>\n<p><strong>EEO - Our philosophy: </strong>Our goal is to ensure every employee feels like they belong and are operating in a judgement-free zone regardless of gender, race, ethnicity, age, and lifestyle preference, among others. We value and celebrate diversity and fervently believe every employee matters and should be respected and heard. We believe we are stronger when we belong because collectively, we’re more innovative, creative, and successful.</p>\n<p>Sprinklr is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. See also Sprinklr’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know.</p></div>",
         "name":"Recruiting Coordinator",
         "type":"external",
         "publication_date":"2021-05-13T23:11:02Z",
         "short_name":"recruiting-coordinator",
         "model_type":"jobs",
         "id":5823235,
         "locations":[
            {
               "name":"Bengaluru, India"
            }
         ],
         "categories":[
            {
               "name":"Recruiting"
            }
         ],
         "levels":[
            {
               "name":"Mid Level",
               "short_name":"mid"
            }
         ],
         "tags":[
            
         ],
         "refs":{
            "landing_page":"https://www.themuse.com/jobs/sprinklr/recruiting-coordinator"
         },
         "company":{
            "id":11960,
            "short_name":"sprinklr",
            "name":"Sprinklr"
         }
      }
   ],
   "aggregations":{
      
   }
}